In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"col1": [1,2,3,4,5],
              "col2": [45,3,12,56,67],
              "col3": "sudh kumar krish naik anil".split()
    
})

In [3]:
df

   col1  col2   col3
0     1    45   sudh
1     2     3  kumar
2     3    12  krish
3     4    56   naik
4     5    67   anil

In [4]:
df["col2"].max()

67

In [5]:
df["col3"]

0     sudh
1    kumar
2    krish
3     naik
4     anil
Name: col3, dtype: object

In [6]:
df.max()

col1       5
col2      67
col3    sudh
dtype: object

In [7]:
df.describe()

           col1       col2
count  5.000000   5.000000
mean   3.000000  36.600000
std    1.581139  27.862161
min    1.000000   3.000000
25%    2.000000  12.000000
50%    3.000000  45.000000
75%    4.000000  56.000000
max    5.000000  67.000000

In [8]:
df.dtypes

col1     int64
col2     int64
col3    object
dtype: object

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int64
 1   col2    5 non-null      int64
 2   col3    5 non-null      object
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [10]:
ages =df['col2']

In [11]:
ages

0    45
1     3
2    12
3    56
4    67
Name: col2, dtype: int64

In [12]:
type(ages)

pandas.core.series.Series

In [13]:
type(df['col3'])

pandas.core.series.Series

In [14]:
df['col3'].shape

(5,)

In [15]:
df.shape

(5, 3)

In [16]:
pd.DataFrame.shape

In [17]:
df1=df[['col1','col2']]

In [18]:
df1

   col1  col2
0     1    45
1     2     3
2     3    12
3     4    56
4     5    67

In [19]:
df[['col1','col2']].head()

   col1  col2
0     1    45
1     2     3
2     3    12
3     4    56
4     5    67

In [20]:
type(df1)

pandas.core.frame.DataFrame

In [21]:
df1.shape

(5, 2)

In [22]:
df[['col1','col2']].shape

(5, 2)

In [23]:
df['col4'] = df['col1']**2

In [24]:
df

   col1  col2   col3  col4
0     1    45   sudh     1
1     2     3  kumar     4
2     3    12  krish     9
3     4    56   naik    16
4     5    67   anil    25

In [25]:
df["col5"] = df["col3"].str[0]

In [26]:
df

   col1  col2   col3  col4 col5
0     1    45   sudh     1    s
1     2     3  kumar     4    k
2     3    12  krish     9    k
3     4    56   naik    16    n
4     5    67   anil    25    a

In [27]:
def test(a):
    return a**2

In [28]:
df['col4_4'] = df["col1"].apply(test)

if df.["col3"].str[i] == "s":
    for i=
    print('s')
else:
    print('z')
    df["col6"]

In [29]:
df

   col1  col2   col3  col4 col5  col4_4
0     1    45   sudh     1    s       1
1     2     3  kumar     4    k       4
2     3    12  krish     9    k       9
3     4    56   naik    16    n      16
4     5    67   anil    25    a      25

In [30]:
def test1(a):
    if a == "s":
        return "s"
    else:
        return "z"

In [31]:
df['col6'] = df['col5'].apply(test1)

In [32]:
df

   col1  col2   col3  col4 col5  col4_4 col6
0     1    45   sudh     1    s       1    s
1     2     3  kumar     4    k       4    z
2     3    12  krish     9    k       9    z
3     4    56   naik    16    n      16    z
4     5    67   anil    25    a      25    z

In [33]:
def test2(a):

IndentationError: expected an indented block (2152327161.py, line 2)

In [34]:
df['col7'] = df["col3"].apply(len)

In [35]:
df

   col1  col2   col3  col4 col5  col4_4 col6  col7
0     1    45   sudh     1    s       1    s     4
1     2     3  kumar     4    k       4    z     5
2     3    12  krish     9    k       9    z     5
3     4    56   naik    16    n      16    z     4
4     5    67   anil    25    a      25    z     4

In [36]:
import math

In [37]:
df['col8']=df['col2'].apply(math.log)

In [38]:
df

   col1  col2   col3  col4 col5  col4_4 col6  col7      col8
0     1    45   sudh     1    s       1    s     4  3.806662
1     2     3  kumar     4    k       4    z     5  1.098612
2     3    12  krish     9    k       9    z     5  2.484907
3     4    56   naik    16    n      16    z     4  4.025352
4     5    67   anil    25    a      25    z     4  4.204693

In [39]:
df

   col1  col2   col3  col4 col5  col4_4 col6  col7      col8
0     1    45   sudh     1    s       1    s     4  3.806662
1     2     3  kumar     4    k       4    z     5  1.098612
2     3    12  krish     9    k       9    z     5  2.484907
3     4    56   naik    16    n      16    z     4  4.025352
4     5    67   anil    25    a      25    z     4  4.204693

In [168]:
above_10 = df[df['col2']>10]

In [169]:
above_10

   col1  col2   col3  col4 col5  col4_4 col6  col7      col8
0     1    45   sudh     1    s       1    s     4  3.806662
2     3    12  krish     9    k       9    z     5  2.484907
3     4    56   naik    16    n      16    z     4  4.025352
4     5    67   anil    25    a      25    z     4  4.204693

In [170]:
df['col2']>10

0     True
1    False
2     True
3     True
4     True
Name: col2, dtype: bool

In [171]:
above_10.shape

(4, 9)

In [172]:
df.shape

(5, 9)

In [173]:
df[df['col3'].notna()]

   col1  col2   col3  col4 col5  col4_4 col6  col7      col8
0     1    45   sudh     1    s       1    s     4  3.806662
1     2     3  kumar     4    k       4    z     5  1.098612
2     3    12  krish     9    k       9    z     5  2.484907
3     4    56   naik    16    n      16    z     4  4.025352
4     5    67   anil    25    a      25    z     4  4.204693

In [174]:
df.loc[df['col2']>10]

   col1  col2   col3  col4 col5  col4_4 col6  col7      col8
0     1    45   sudh     1    s       1    s     4  3.806662
2     3    12  krish     9    k       9    z     5  2.484907
3     4    56   naik    16    n      16    z     4  4.025352
4     5    67   anil    25    a      25    z     4  4.204693

In [175]:
df.iloc[0:2, :4]

   col1  col2   col3  col4
0     1    45   sudh     1
1     2     3  kumar     4

In [176]:
df.iloc[slice(0,2), slice(0,4,2)]

   col1   col3
0     1   sudh
1     2  kumar

In [177]:
import matplotlib.pyplot as plt
import pandas as pd

In [209]:
df = pd.read_html("https://github.com/pandas-dev/pandas/blob/main/doc/data/air_quality_no2.csv",index_col=0,parse_dates=True)

In [210]:
df

[                datetime  station_antwerp  station_paris  station_london
 NaT  2019-05-07 02:00:00              NaN            NaN            23.0
 NaT  2019-05-07 03:00:00             50.5           25.0            19.0
 NaT  2019-05-07 04:00:00             45.0           27.7            19.0
 NaT  2019-05-07 05:00:00              NaN           50.4            16.0
 NaT  2019-05-07 06:00:00              NaN           61.9             NaN
 ..                   ...              ...            ...             ...
 NaT  2019-06-20 22:00:00              NaN           21.4             NaN
 NaT  2019-06-20 23:00:00              NaN           24.9             NaN
 NaT  2019-06-21 00:00:00              NaN           26.5             NaN
 NaT  2019-06-21 01:00:00              NaN           21.8             NaN
 NaT  2019-06-21 02:00:00              NaN           20.0             NaN

 [1035 rows x 4 columns]]

In [211]:
type(df)

list

In [212]:
len(df)

1

In [213]:
df1 = pd.DataFrame(df)

ValueError: Must pass 2-d input. shape=(1, 1035, 4)

In [202]:
air_quality = pd.to_csv("/Users/anilreddykunta/Desktop/Anil/AltaML/air quality.csv")

AttributeError: module 'pandas' has no attribute 'to_csv'